In [1]:
import pandahouse as ph
connection = {'host': 'http://clickhouse.beslan.pro:8080',
                      'database':'',
                      'user':'', 
                      'password':''
                     }

In [2]:
q = '''
    SELECT
    COUNT(st_id)
    FROM(
        SELECT
            st_id,
            SUM(correct) correct_sum
        FROM default.peas
        GROUP BY st_id
        )sub1
    WHERE correct_sum >= 20
    '''
result = ph.read_clickhouse(query=q, connection=connection)
result

   count(st_id)
0           136

In [3]:
q = '''
    SELECT 
        b.test_grp AS test_grp,
        ROUND(SUM(c.money)/uniq(b.st_id), 1) AS ARPU,
        ROUND(SUM(CASE WHEN a.tasks > 10 THEN c.money END)/uniq(CASE WHEN a.tasks > 10 THEN b.st_id END), 1) AS ARPAU,
        ROUND(100*uniq(CASE WHEN c.money > 0 THEN b.st_id END)/uniq(b.st_id), 2) AS CR,
        ROUND(100*uniq(CASE WHEN c.money > 0 AND a.tasks > 10 THEN b.st_id END)/
            uniq(CASE WHEN a.tasks > 10 THEN b.st_id END), 2) AS CR_active,
        ROUND(100*uniq(CASE WHEN c.money > 0 AND subject = 'Math' AND a.math_tasks > 2 THEN b.st_id END)/
            uniq(CASE WHEN a.math_tasks >= 2 THEN b.st_id END), 2) AS CR_active_math
    FROM
        (
        SELECT
            st_id,
            SUM(correct) AS tasks,
            SUM(CASE WHEN subject == 'Math' THEN correct END) AS math_tasks
        FROM peas
        GROUP BY st_id
        ) AS a
        FULL JOIN studs AS b ON a.st_id = b.st_id
        FULL JOIN final_project_check AS c ON b.st_id = c.st_id
    GROUP BY test_grp
    '''
result2 = ph.read_clickhouse(query=q, connection=connection)
result2

  test_grp     ARPU    ARPAU     CR  CR_active  CR_active_math
0  control   4541.0  10393.7   4.92      11.02            6.12
1    pilot  11508.5  29739.6  10.85      26.04            9.52